OSMICardsTo1Ci/src/DataProcessors/ОСМИ_МастерПоНастройке/ОСМИ_МастерПоНастройке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОСМИ_МастерПоНастройке</name>
</mdclass:DataProcessor>

OSMICardsTo1Ci/src/Catalogs/ОСМИ_ШаблонКарты/ОСМИ_ШаблонКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_ШаблонКарты</name>
  <attributes>
    <name>СодержимоеБаркода</name>
    <type>
      <types>EnumRef.ОСМИ_СодержимоеБаркодаПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияСодержимогоБаркода</name>
    <type>
      <types>CatalogRef.ОСМИ_ИсточникДанных</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьБаркод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеПодписи</name>
    <type>
      <types>EnumRef.ОСМИ_СодержимоеБаркодаПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияСодержимогоПодписи</name>
    <type>
      <types>CatalogRef.ОСМИ_ИсточникДанных</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляШаблона</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>46</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПолучения</name>
      <type>
        <types>CatalogRef.ОСМИ_ИсточникДанных</types>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОповещения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьПУШ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

OSMICardsTo1Ci/src/DataProcessors/ОСМИ_МастерПоНастройке/Forms/ФормаНастройкиШаблонов/Module.bsl
&НаСервереБезКонтекста
Процедура ЗагрузитьШаблоныНаСервере()
	СписокШаблонов = ОСМИ_РаботаСAPI.ЗапроситьСписокДоступныхШаблонов();
	Если СписокШаблонов.Успех Тогда
		Для Каждого Шаблон Из СписокШаблонов.Ответ.templates Цикл
			ШаблонСпр = Справочники.ОСМИ_ШаблонКарты.НайтиПоНаименованию(Шаблон,Истина);
			Если ШаблонСпр = Неопределено или ШаблонСпр = Справочники.ОСМИ_ШаблонКарты.ПустаяСсылка() Тогда 
				СпрОб = Справочники.ОСМИ_ШаблонКарты.СоздатьЭлемент();
				СпрОб.Наименование = Шаблон;
				СпрОб.ОбновитьССервера();
				СпрОб.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШаблоны(Команда)
	ЗагрузитьШаблоныНаСервере();
	
	ЭтаФорма.Закрыть();
	
	ОткрытьФорму("Обработка.ОСМИ_МастерПоНастройке.Форма.ФормаНастройкиШаблонов");
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьОтображение()
	СписокШаблонов = ПолучитьСписокШаблонов();
	Для Каждого Шаблон Из СписокШаблонов Цикл
		ИмяШаблонаБезПробелов = "Шаблон"+СтрЗаменить(Шаблон.Значение," ","u23");
			
		ДобавляемыеРеквизиты = Новый Массив();                                           
		Реквизит = Новый РеквизитФормы(ИмяШаблонаБезПробелов,новый ОписаниеТипов("СправочникОбъект.ОСМИ_ШаблонКарты"),,"Шаблон");
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЗначениеВРеквизитФормы(Шаблон.Значение.ПолучитьОбъект(),ИмяШаблонаБезПробелов);
		
		//СписокШаблонов.Добавить(ИмяШаблонаБезПробелов);
		
		//Добавим Страницу		
		ГруппаШаблона = ЭтаФорма.Элементы.Добавить(
		ИмяШаблонаБезПробелов,
		Тип("ГруппаФормы"),
		ЭтаФорма.Элементы.Шаблоны);
		ГруппаШаблона.Заголовок = "" + Шаблон.Значение;

		//Добавим шаблон на вкладку для быстрого перехода
		//Эл = ЭтаФорма.Элементы.Добавить(ИмяШаблонаБезПробелов+"Ссылка",Тип("ПолеФормы"),ЭтаФорма.Элементы.Найти(ИмяШаблонаБезПробелов));
		//Эл.ПутьКДанным = ИмяШаблонаБезПробелов+".Ссылка";
		//Эл.Вид = ВидПоляФормы.ПолеВвода;
		//Эл.ТолькоПросмотр = Истина;		
		
		//Эл = ЭтаФорма.Элементы.Добавить(ИмяШаблонаБезПробелов + "Сохранить",Тип("КомандаФормы"),ЭтаФорма.Элементы.Найти(ИмяШаблонаБезПробелов));
		//Эл.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		//Эл.УстановитьДействие("Нажатие","ПоляПриИзмененииСтроки");
		
		
		
		//Добавим группу команд шаблона
		ЭлГруппаКомманд = ЭтаФорма.Элементы.Добавить(
		ИмяШаблонаБезПробелов+"ГруппаКомманд",
		Тип("ГруппаФормы"),
		ГруппаШаблона);
		ЭлГруппаКомманд.вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлГруппаКомманд.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлГруппаКомманд.СквозноеВыравнивание = СквозноеВыравнивание.НеИспользовать;
		
		//Добавляем форме команду
		Кмд = ЭтаФорма.Команды.Добавить(ИмяШаблонаБезПробелов);
		Кмд.Действие = "ПоляПриИзмененииСтроки";
		Кмд.Заголовок = "Сохранить";
		
		//Добавляем саму кнопку
		Элемент = ЭтаФорма.Элементы.Добавить(ИмяШаблонаБезПробелов + "Сохранить", Тип("КнопкаФормы"), ЭлГруппаКомманд);
		Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Элемент.ИмяКоманды = ИмяШаблонаБезПробелов; 

		
		////Добавим Флажок - Обновлять карты шаблона
		//Эл = ЭтаФорма.Элементы.Добавить(
		//ИмяШаблонаБезПробелов+"ОбновлятьКартыШаблона",
		//Тип("ПолеФормы"),
		//ЭлГруппаКомманд);
		//Эл.ПутьКДанным = ИмяШаблонаБезПробелов+".ОбновлятьКартыШаблона";
		//Эл.Вид = ВидПоляФормы.ПолеФлажка;
		//Эл.УстановитьДействие("ПриИзменении","ПоляПриИзменении");
	

		//Выведем список полей...
		СЧ = 0;
		Для Каждого ТекПоле из ЭтаФорма[ИмяШаблонаБезПробелов].ПоляШаблона.выгрузить() Цикл
			
			//Добавиим группу лейбла
			НомерСтроки = ТекПоле.НомерСтроки;
			ИмяПоля = "Поле"+СЧ;
			
			ЭлГруппа = ЭтаФорма.Элементы.Добавить(
			ИмяШаблонаБезПробелов+ИмяПоля+"Группа",
			Тип("ГруппаФормы"),//
			ГруппаШаблона);
			///ЭлГруппа.ус
			ЭлГруппа.вид = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			ЭлГруппа.ОтображатьЗаголовок = Ложь;
			//ЭлГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			
			//Эл.Заголовок = "" + Шаблон.Значение;
			
			Эл = ЭтаФорма.Элементы.Добавить(
			ИмяШаблонаБезПробелов+ИмяПоля+"Имя",
			Тип("ПолеФормы"),ЭлГруппа);
			Эл.Вид = ВидПоляФормы.ПолеНадписи;
			Эл.Заголовок = "Поле";
			Эл.ПутьКДанным = ИмяШаблонаБезПробелов+".ПоляШаблона["+СЧ+"].Имя";
			//Эл.УстановитьДействие("ПриИзменении","ПоляПриИзмененииСтроки");
			
			Эл = ЭтаФорма.Элементы.Добавить(
			ИмяШаблонаБезПробелов+ИмяПоля+"СпособПолучения",
			Тип("ПолеФормы"),ЭлГруппа);
			Эл.Вид = ВидПоляФормы.ПолеВвода;
			Эл.Заголовок = "Значение";
			Эл.ПутьКДанным = ИмяШаблонаБезПробелов+".ПоляШаблона["+СЧ+"].СпособПолучения";
			//Эл.УстановитьДействие("ПриИзменении","ПоляПриИзмененииСтроки");
			
			Эл = ЭтаФорма.Элементы.Добавить(
			ИмяШаблонаБезПробелов+ИмяПоля+"ТекстОповещения",
			Тип("ПолеФормы"),ЭлГруппа);
			Эл.Вид = ВидПоляФормы.ПолеВвода;
			Эл.Заголовок = "Текст обновления";
			Эл.ПутьКДанным = ИмяШаблонаБезПробелов+".ПоляШаблона["+СЧ+"].ТекстОповещения";
			//Эл.УстановитьДействие("ПриИзменении","ПоляПриИзмененииСтроки");

			Эл = ЭтаФорма.Элементы.Добавить(
			ИмяШаблонаБезПробелов+ИмяПоля+"ОтправлятьПУШ",
			Тип("ПолеФормы"),ЭлГруппа);
			Эл.Вид = ВидПоляФормы.ПолеФлажка;
			Эл.Заголовок = "Отправлять уведомление";
			Эл.ПутьКДанным = ИмяШаблонаБезПробелов+".ПоляШаблона["+СЧ+"].ОтправлятьПУШ";
			//Эл.УстановитьДействие("ПриИзменении","ПоляПриИзмененииСтроки");

			СЧ = СЧ+1;
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоляПриИзменении(Элемент)
	ЗаписатьНаСервере(Элемент.Родитель.Родитель.Имя)
КонецПроцедуры

&НаСервере 
Процедура ЗаписатьНаСервере(ОБ)
	ОбФ = РеквизитФормыВЗначение(ОБ,Тип("СправочникОбъект.ОСМИ_ШаблонКарты"));
	ОбФ.Записать();
	ЗначениеВРеквизитФормы(ОБФ,ОБ);
КонецПроцедуры

&НаКлиенте
Процедура ПоляПриИзмененииСтроки(Элемент)
	ЗаписатьНаСервере(Элемент.Имя)
КонецПроцедуры

&НаСервере                        
Функция ПолучитьСписокШаблонов()
	СписокШаблоновВыб = Справочники.ОСМИ_ШаблонКарты.Выбрать();
	Пока СписокШаблоновВыб.Следующий() Цикл		
		СписокШаблонов.Добавить(СписокШаблоновВыб.Ссылка);
	КонецЦикла;
	Возврат СписокШаблонов;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокШаблонов = новый СписокЗначений;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображение();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры
